"use client";

import React from 'react';

interface Props {
className?: string;
}

export const List: React.FC<Props> = ({ className }) => {
    const [isOpen, setIsOpen] = React.useState(false);
    
        const toggle = () => {
        setIsOpen(!isOpen);
      };

  return (
<div className="flex flex-col items-center w-full gap-y-[12px]">
          <div onClick={toggle} className={`cursor-pointer justify-between flex flex-row items-center w-full py-[16px] border-b-[1px] ${isOpen ? 'border-[var(--color3)]' : 'border-[#78788029]'}`}>
            <span className="font-[600] text-[14px] font-[Montserrat] text-[#101012]">
              Как записаться на электив / факультатив?
            </span>
            <svg
              className={`w-[16px] h-[16px] transition-transform duration-300 ${isOpen ? 'rotate-180' : ''}`}
              viewBox="0 0 16 16"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M3.62387 5.9495C3.93626 5.63722 4.44298 5.63722 4.75538 5.9495L7.81137 9.00614C7.87852 9.0733 7.93166 9.12591 7.97803 9.17086C7.98554 9.17813 7.99276 9.18522 7.99952 9.19169C8.0064 9.18511 8.014 9.17827 8.02165 9.17086C8.06802 9.12593 8.12119 9.07328 8.18832 9.00614L11.2443 5.9495L11.3055 5.89481C11.6196 5.63869 12.0829 5.65686 12.3758 5.9495C12.6687 6.24237 12.6874 6.70626 12.4312 7.02047L12.3758 7.08101L9.31983 10.137C9.19719 10.2596 9.0716 10.3864 8.9559 10.4847C8.83307 10.5889 8.66969 10.7073 8.45329 10.7776C8.15882 10.8733 7.84153 10.8733 7.54704 10.7776L7.46827 10.7496C7.29012 10.6784 7.15136 10.576 7.04379 10.4847C6.9281 10.3864 6.80248 10.2596 6.67986 10.137L3.62387 7.08101C3.31158 6.76861 3.31157 6.26189 3.62387 5.9495Z"
                fill="#101012"
              />
            </svg>
          </div>
          {isOpen && (
          <p className="font-[500] text-[14px] font-[Montserrat] text-[#3C3C43B8]">Шаг 1. Зайди в Личный кабинет студента → раздел «Элективы/выбор дисциплин».
Шаг 2. Открой список доступных курсов (с квотами и расписанием) → нажми «Выбрать».
Шаг 3. Убедись, что окно выбора открыто (сроки обычно 3–7 дней).
Шаг 4. Сохрани выбор и проверь, что дисциплина появилась в твоём плане/расписании.
Если мест нет: встань в лист ожидания или выбери альтернативу; староста/методист подскажет, будут ли добавочные места.
Важно: после закрытия окна выбор фиксируется; смена возможна только по заявлению и при наличии мест.</p>  )}
        </div>
  );
};